;*******************************************************************************************
;  FILE:   MORE Psionics Ex Machina. int                                 
;  
;	File created	25/07/20    21:00
;	LAST UPDATED    29/06/22	11:00
;
;*******************************************************************************************

[UIAlert_PEXM]
m_strPexmProjectCompleteLabel = "实验灵能项目已完成"

[UISL_Shell_RustyPexM]
strMessage_Title = "[WOTC] Psionics Ex Machina（灵能之神计划）"
strMessage_Header = "警告: 该机制把意志力变成魔法值!"
strDismiss_Button = "好的"

;string below dynamically adds the display name of exempt classes from the config file, values for the will drain and if the config is set to on/off
strMessage_Body = "这个配置文件 <font color='#b6b3e3'>[WOTC] Psionics Ex Machina</font> 具有将意志力变成魔法值的机制 <VALUEBOOL/>.<br/>如果这是第一次安装，您将需要重新启动XCOM2，否则它将崩溃!<br/>&nbsp;请确保你的Mod Config Menu设置中 <font color='#3CEDD4'>[WOTC] Robojumper's Squad Select</font> 模组选项 'Show Upgrades Only For Primaries' 处于未选中/关闭状态, 或者你正在使用 <font color='#3CEDD4'>[WOTC] Mod Everything Reloaded</font>模组, （这两个模组之一将使你）可以获取灵能增幅器上的升级插槽.<br/><br/>&nbsp;该机制使所有基于GEM能力的灵能技能消耗单位的意志力, 你可以看到单位标志上将显示为血条下的一条线, 或许还显示其他许多UI增强模块.<br/>每个灵能施放的意志力流逝设置为 <VALUEMIN/><VALUEMAX/>.<br/><br/>以下职业不受意志力流逝的影响:"
strActive = "激活"
strInActive = "关闭"

[X2DownloadableContentInfo_PsionicsExMachina]
PsiGradingNeeded = "需要的灵能等级"

[X2Item_PsionicsExMachina]
GEM = "[%Tier] 级灵能石"
PCS = "个人战斗芯片"
Grants = "等级"
FreeSlotCostString = "这个元灵能石赋予了一个额外的槽位奖励"
m_strComboPerk = "需要连接"
m_strPsiCostRange = "灵能花费"

[XComGame.UIAvengerShortcuts]
[UISL_AvengerHUD_Shortcuts_PexM]
;label gets the cool UI Psi Icon added to the front
LabelShortcut_PexMChamber="灵能实验室"
TooltipShortcut_PexMChamber="前往灵能实验室"

[XComGame.UIFacility_PexMLab]
[UIFacility_PexMLab]
m_strProjectFacilityName="灵能实验室"
m_strStartProject="选择项目"
m_strProjectedHours="预计时间："
m_strProjectedDays="预计时间："
m_strEmptyQueue="当前队列中没有项目"
m_strCurrentProject="当前："
m_strCancelPexMProjectTitle="取消项目？"
m_strCancelPexMProjectBody="确定要取消 <XGParam:StrValue0/> 吗？"
m_strProgress="进度："
m_strEditQueue="编辑序列："
m_strMoveItemUp="项目上移"
m_strMoveItemDown="项目下移"
m_strRemoveItem="取消项目"
m_strCheckInventory="访问灵能库存"

[UIFacility_PexMLabSlot]
m_strPexMTrainingDialogTitle="训练: 灵能士兵"
m_strPexMTrainingDialogText="<XGParam:StrValue0/!UnitName/> 可以进行灵能训练。 <XGParam:IntValue0/!DaysToTrain/> 天之内他将不能参战。确定开始训练吗？"
m_strStopPexMTrainingDialogTitle="取消训练"
m_strStopPexMTrainingDialogText="确定取消 %UNITNAME 的训练吗？\n\n警告：所有训练成果都会丢失"
m_strPauseAbilityTrainingDialogTitle="暂停训练"
m_strPauseAbilityTrainingDialogText="确定暂停 %UNITNAME 的训练吗？\n\nNOTE: 当前进度会丢失"
m_strNoSoldiersTooltip="无人可以训练"
m_strSoldiersAvailableTooltip="拥有可以进行训练的士兵"

[XComGame.UIChoosePexMProject]
[UIChoosePexMProject]
m_strTitle=灵能实验项目
m_strSubTitleTitle= 
m_strInventoryLabel=灵能实验项目
m_strPriority=[优先事项]
m_strPaused=[暂停]
m_strResume=[恢复]
m_strEmptyListTitle=无可用灵能项目
m_strBuy=[开始]
m_strTime=已完成项目：

[XComGame.UIInventory]
[UIInventory_PexM]
m_strTitle=灵能库存
m_strInventoryLabel=灵能库存
m_strTitleBig=灵能库存
m_strNoLoot=无可用灵能

[X2EventListener_PexMWillEvents]
ClarityActivated = "专注耗尽"
PsionicActivated = "灵能枯竭"

[X2EventListener_FreeCostGEMS]
strSlotLocked = "无效槽位 - 已锁定"

[X2Effect_ModifyStatAsPercentile_PexMWillSyphon]
StatChangedMessage="<StatChanged/> 心灵虹吸"
